<!DOCTYPE html>

<html>
    <head>
        <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <meta name="author" content="Ignacio Cuevas Serrano">
        <title>Ejercicio 1</title>
        <link rel="stylesheet" type="text/css" href="css/estilos.css">
    </head>
    <body>
        <h1>Ejercicio 1</h1>
        <h2>Ejemplo 1: </h2>
        <div class="banner">El siguiente texto se ha obtenido desde la web de Wikipedia Firefox e IExplorer: yellow </div>
        <div>Macromedia Dreamweaver es un editor WYSIWYG de  p&aacute;ginas web, creado por Macromedia(actualmente Adobe Systems, el cual  va por la versi&oacute;n 8. <span class="seleccionado">Es el programa de este tipo m&aacute;s utilizado en el  sector del dise&ntilde;o y la programaci&oacute;n web (Firefox e IExplorer: teal) </span>, por sus funcionalidades, su  integraci&oacute;n con otras herramientas como Macromedia Flash <span class="seleccionado">y,  recientemente, por su soporte de los est&aacute;ndares del (Firefox e IExplorer: teal) <acronym title="World Wide Web  Consortium">W3C (Firefox: purple, IExplorer: teal) </acronym>.</span> Su principal competidor es Microsoft Frontpage. Tiene  soporte tanto para edici&oacute;n de im&aacute;genes como para animaci&oacute;n a trav&eacute;s de  su integraci&oacute;n con otras herramientas </div>
        <h2>Ejemplo 2:</h2>
        <p>En un lugar de la <span class="subrayado_rojo">Mancha</span>, de cuyo nombre no quiero acordarme, no ha mucho tiempo que viv&iacute;a un hidalgo de los de lanza en astillero, adarga antigua, <span class="borde_lima">roc&iacute;n </span>flaco y <span class="borde_lima">galgo</span> corredor. Una olla de algo m&aacute;s <span class="borde_lima">vaca</span> que <span class="borde_lima">carnero</span>, salpic&oacute;n las m&aacute;s noches, duelos y quebrantos los s&aacute;bados, lentejas los viernes, alg&uacute;n palomino de a&ntilde;adidura los domingos, <span class="subrayado_azul">consum&iacute;an las tres partes de su hacienda</span>. </p>
        <h2>Ejemplo 3: </h2>
        <div class="caja1"></div>
        <div class="caja2"></div>
        <h2>Ejemplo 4: </h2>
        <div class="caja3">
            texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto texto 
        </div>
        <p class="bordes"><span class="borde">solid</span> <span class="borde doble">double</span> <span class="borde rayado">dashed</span> <span class="borde punteado">dotted</span> <span class="borde surcado">groove</span> <span class="borde rugoso">ridge</span> <span class="borde adentro">inset</span> <span class="borde afuera">outset</span></p>
    </body>
</html>
